{"meta":{"title":"高级机器学习实验室","subtitle":"学习理论、在线优化、网络技术","description":"","author":"John Doe","url":"https://advanced-machine-learning-lab.github.io","root":"/"},"pages":[{"title":"","date":"2024-12-11T13:48:20.563Z","comments":true,"path":"research/index.html","permalink":"https://advanced-machine-learning-lab.github.io/research/","excerpt":"","text":"研究方向 Learning Theory Online Learning: Experts, Bandits, Online Convex Optimization, Multi-scale Online Learing，Online Learning with Attacks&#x2F;Corruptions Distributed Learning&#x2F;Estimation Online Optimization Online Knapsack Problems: Online Multidimensional Knapsack, Online Multiple Knapsack, Online Knapsack with Departure etc. Online Linear Programming, Online Buffer Management Networking Software Defined Networking, Cloud Computing, Data Centers, etc. Performance Analysis, Modeling, and Online Resource Optimization for Networked Computing Systems 发表论文： Asynchronous Multi-Agent Bandits: Fully Distributed vs. Leader-Coordinated AlgorithmsXuchuang Wang, Janice Chen, Xutong Liu, , Lin Yang*, Mohammad Hajiesmaili, John CS Lui, Don Towsley ACM International Conference on Measurement and Modeling of Computer Systems (SIGMETRICS), June 2025. (Full Paper) [AISTATS 2023] On-Demand Communication for Asynchronous Multi-Agent Bandits (to appear)Yu-zhen Janice Chen, Lin Yang*, Xuchuang Wang, Xutong Liu, Mohammad Hajiesmaili, John C.S. Lui, Don TowsleyThe 26th International Conference on Artificial Intelligence and Statistics (AISTATS 2023), 2023. [ICLR 2023] Achieve Near-Optimal Individual Regret &amp; Low Communications in Multi-Agent Bandits (to appear)Xuchuang Wang, Lin Yang*, Yu-zhen Janice Chen, Xutong Liu, Mohammad Hajiesmaili, Don Towsley, John C.S. LuiThe Eleventh International Conference on Learning Representations (ICLR 2023), 2023. [SIGMETRICS 2023] The Online Knapsack Problem with DeparturesBo Sun#, Lin Yang#, Mohammad Hajiesmaili, Adam Wierman, Don TowsleyACM International Conference on Measurement and Modeling of Computer Systems (SIGMETRICS), June 2023. (Full Paper). [SIGMETRICS 2022] Hierarchical Learning Algorithms for Multi-scale Expert ProblemsLin Yang, Yu-zhen Chen, Mohammad Hajiesmaili, Mark Herbster, Don TowsleyACM International Conference on Measurement and Modeling of Computer Systems (SIGMETRICS), June 2022. (Full Paper)Journal Version: Proceedings of the ACM on Measurement and Analysis of Computing Systems (POMACS), 2022, 6(2): 1-29. [INFOCOM 2022] Distributed Bandits with Heterogeneous AgentsLin Yang, Yu-zhen Chen, Mohammad Hajiesmaili, John CS Lui, Don TowsleyIEEE International Conference on Computer Communications (INFOCOM), 2022. [SIGMETRICS 2022] Competitive Algorithms for Online Multidimensional Knapsack ProblemsLin Yang, Ali Zeynali, Mohammad Hajiesmaili, Ramesh Sitaraman, Donald F. TowsleyACM International Conference on Measurement and Modeling of Computer Systems (SIGMETRICS), June 2022. (Full Paper)Journal Version: Proceedings of the ACM on Measurement and Analysis of Computing Systems (POMACS), 2021, 5(3): 1-30. [NeurIPS 2021] Cooperative Stochastic Bandits with Asynchronous Agents and Constrained FeedbackLin Yang, Yu-Zhen Janice Chen, Stephen Pasteris, Mohammad Hajiesmaili, John CS Lui, Don TowsleyAdvances in Neural Information Processing Systems (NeurIPS), 2021. [Performance 2021] Competitive Bidding Strategies for Online Linear Optimization with Inventory Management ConstraintsRussell Lee, Yutao Zhou, Lin Yang, Mohammad Hajiesmaili, Ramesh SitaramanIFIP Performance, 2021. Learning Based Control Policy and Regret Analysis for Online Quadratic Optimization with Asymmetric Information Structure Cheng Tan, Lin Yang*, Wing Shing Wong Transactions on Cybernetics, 2021. [NeurIPS 2020] Adversarial Bandits with Corruptions: Regret Lower Bound and No-regret AlgorithmLin Yang, Mohammad Hajiesmaili, Mohammad Sadegh Talebi, John CS Lui, Wing Shing WongAdvances in Neural Information Processing Systems (NeurIPS), 2020. [SIGMETRICS 2020] Online Linear Optimization with Inventory Management ConstraintsLin Yang#, Mohammad Hajiesmaili#, Ramesh Sitaraman, Adam Wierman, Enrique Mallada, Wing Shing WongACM International Conference on Measurement and Modeling of Computer Systems (SIGMETRICS), June 2020. (Full Paper)Journal Version: Proceedings of the ACM on Measurement and Analysis of Computing Systems (POMACS), 2020, 4(1): 1-29. Online Linear Programming with Uncertain ConstraintsLin Yang, Mohammad H. Hajiesmaili, and Wing Shing WongProceedings of The 53rd Annual Conference on Information Sciences and Systems (CISS). 2019. (Invited Paper) Stabilization of Discrete Time Stochastic System with Input Delay and Control Dependent Noise Cheng Tan, Lin Yang, Fangfang Zhang, Zhenqiang Zhang and Wing Shing WongSystems &amp; Control Letters, 2019, 123: 62–68. An Average Queue-Length-Difference-Based Congestion Detection Algorithm in TCP&#x2F;AQM NetworkJin Zhu, Tong Luo, Lin Yang, Wanqing Xie, and G. E. DullerudInternational Journal of Adaptive Control and Signal Processing. 2018. [SIGMETRICS 2017] Hour-Ahead Offering Strategies in Electricity Market for Power Producers with Storage and Intermittent SupplyLin Yang#, Mohammad H. Hajiesmaili#, Hanling Yi, and Minghua ChenACM International Conference on Measurement and Modeling of Computer Systems (SIGMETRICS), June 2017. (Poster Paper) Gittins Index Based Control Policy for a Class of Pursuit-Evasion ProblemsCheng Tan, Changbao Xu, Lin Yang, and Wing Shing WongIET Control Theory and Applications, 12(1), 110-118, 2017. Competitive Online Algorithms for Geographical Load Balancing in Data Centers with Energy StorageChi-Kin Chau, Lin YangProceedings of the 5th International Workshop on Energy Efficient Data Centres. 2016. An Optimal Vertical Handoff Decision Algorithm for Multiple Services with Different Priorities in Heterogeneous Wireless NetworksJin Zhu, Limin Xu, Lin Yang, Wanqing XieWireless Personal Communications 83 (1), 527-549, 2015. [ComLett] Time Series Analysis for Congestion Detection in TCP&#x2F;AQM NetworksLin Yang, Jin Zhu, Wanqing Xie, and G. E. DullerudIEEE Communications Letters, 19(3), 331-334, 2015. ​ (#: Equal Contribution or Co-first Author; *: Corresponding Author)"},{"title":"","date":"2024-12-11T13:09:58.591Z","comments":true,"path":"member/index.html","permalink":"https://advanced-machine-learning-lab.github.io/member/","excerpt":"","text":"办公室: 南京大学苏州校区 个人主页: https://yanglin2021.github.io/index.html 教育背景（Lin Yang）： 2015年8月 - 2018年8月 Ph.D. in Information Engineering, The Chinese University of Hong Kong, Hong Kong. Advisor: Wing Shing Wong (FIEEE) Thesis: Competitive and Regret Analysis for Online Optimization 2012年8月 - 2015年6月 Master in Automatic Control , University of Science and Technology of China, Hefei. Advisor: Jin Zhu 2008年8月 - 2012年6月 Bachelor in Information Science , University of Science and Technology of China, Hefei. 邮箱: linyang@nju.edu.cn, yanglin.cuhk@gmail.com 相关链接: homepage , Google Scholar , CV 博士生: 硕士生: 本科生: 科研助理:"},{"title":"","date":"2024-12-11T14:08:33.302Z","comments":true,"path":"activity/index.html","permalink":"https://advanced-machine-learning-lab.github.io/activity/","excerpt":"","text":"实验室活动 Workshop on Information, Networking, Control, and Communications会议 实验室团建"},{"title":"","date":"2024-12-11T14:01:13.742Z","comments":true,"path":"project/index.html","permalink":"https://advanced-machine-learning-lab.github.io/project/","excerpt":"","text":"项目机器学习前沿理论和算法研究 南京大学苏州校区人才启动经费项目 100万 基于在线机器学习的TopK推荐算法 江苏省双创博士项目 20万 边端大模型的轻量化以及FPGA部署 苏州市关键核心技术“揭榜挂帅”攻关 300万 基于单极式拓扑的高效高功率密度微型光储逆变器及系统研发 苏州市关键核心技术“揭榜挂帅”攻关 850万 基于人工智能的光伏电网电弧检测 企业横向 30万 面向测试场景集质量评估的评估工具开发 2024航天一院联合创新 70万"}],"posts":[{"title":"主页","slug":"高级机器学习实验室","date":"2023-06-05T06:54:22.710Z","comments":true,"path":"2023/06/05/高级机器学习实验室/","link":"","permalink":"https://advanced-machine-learning-lab.github.io/2023/06/05/%E9%AB%98%E7%BA%A7%E6%9C%BA%E5%99%A8%E5%AD%A6%E4%B9%A0%E5%AE%9E%E9%AA%8C%E5%AE%A4/","excerpt":"","text":"高级机器学习实验室（Advanced Deep Machine Learning, ADML） 隶属于南京大学计算机科学与技术系和南京大学智能科学与技术学院，位于南京苏州校区南雍楼，总部在南雍楼东516，负责人是杨林教授。 ADML实验室为专注于前沿科技研究的学术团队，致力于边缘端大模型、RAG（检索增强生成） 以及机器学习 等领域的深入探索。实验室目前拥有数十名科研人员，其中硕士和博士研究生共八人，他们在各自的研究领域中展现出卓越的学术能力和创新精神。实验室的核心成员杨林研究员，凭借其深厚的学术背景和丰富的科研经验，带领团队在人工智能领域不断取得突破。并且ADML实验室依托南京大学智能科学与技术学院构建，南京大学智能科学与技术学院是南大苏州校区先期建设的四大学院之一，是依托南京大学人工智能学院所成立的以人工智能研究为核心，涵盖机器学习、认知科学与类脑智能等前沿方向的基础研究基地和人才培养基地。学院目前已拥有一支以谭铁牛、周志华院士为首的具有国际影响力的优势团队，在人工智能多个领域均取得了国际一流水平的研究成果。南京大学拥有计算机科学与技术国家一级重点学科和“计算机软件新技术国家重点实验室” 等一流科研平台。其中，计算机软件新技术国家重点实验室在过去15 年内已经连续三次在国家评估中被评为信息科学领域优秀类国家重点实验室（在计算机领域排名第一）。 杨林研究员的研究方向主要集中在人工智能（大模型）和机器学习（强化学习、在线优化）等领域。他目前担任中国计算机协会专委会委员，涵盖人工智能与模式识别、分布式计算与系统、理论计算机科学等多个领域，同时也是美国分布式信息技术协会（DAIS）的会员。此外，他还担任NeurIPS、JMLR等多个国际顶级会议和期刊的程序委员会成员及审稿人。与2022年加入南京大学智能科学与技术学院并创立ADML实验室。 招生 实验室招收2025年推免硕士生、直博生，以及申请-考核制博士，研究方向为前沿机器学习理论相关课题（包括在线机器学习、可信机器学习、在线优化、分布式学习、大模型等）。有意向的同学请直接将简历发送邮箱：&#108;&#x69;&#x6e;&#121;&#x61;&#110;&#103;&#x40;&#110;&#x6a;&#117;&#46;&#x65;&#100;&#x75;&#46;&#99;&#110;。 新闻 邀请华为理论研究部高级研究员 邓磊博士 来院访问","categories":[],"tags":[]}],"categories":[],"tags":[]}
