{"meta":{"title":"Advanced Machine Learning Lab","subtitle":"Learning Theory, Online Optimization, Networking","description":"","author":"Lin Yang","url":"http://distributed-learning.github.io","root":"/"},"pages":[{"title":"activity","date":"2023-06-04T04:08:14.000Z","updated":"2023-06-04T06:42:42.000Z","comments":true,"path":"activity/index.html","permalink":"http://distributed-learning.github.io/activity/index.html","excerpt":"","text":""},{"title":"Main member of the research group","date":"2023-06-04T13:25:00.872Z","updated":"2023-06-04T13:25:00.872Z","comments":true,"path":"member/index.html","permalink":"http://distributed-learning.github.io/member/index.html","excerpt":"","text":"Teacher：杨林 教授 Tenure-track Assistant Professor (准聘助理教授，特聘研究员，博士生导师) Nanjing University, School of Intelligent Science and Technology (Suzhou Campus) Office: Nanjing University, Suzhou Campus. Homepage: https://yanglin2021.github.io/index.html Lin Yang EDUCATION： August 2015 - August 2018 Ph.D. in Information Engineering, The Chinese University of Hong Kong, Hong Kong. Advisor: Wing Shing Wong (FIEEE) Thesis: Competitive and Regret Analysis for Online Optimization August 2012 - June 2015 Master in Automatic Control , University of Science and Technology of China, Hefei. Advisor: Jin Zhu August 2008 - June 2012 Bachelor in Information Science , University of Science and Technology of China, Hefei. Email: linyang@nju.edu.cn, yanglin.cuhk@gmail.com related links: homepage , Google Scholar , CV Biography Before Joining Nanjing University in 2022 August, I was a Postdoctoral Research Associate in Department of Computer Science of UMass, Amherst, working with Professor Don Towsley and Mohammad Hajiesmaili. I got my PhD degree from The Chinese University of Hong Kong in 2018, (fortunately) supervised by Professor Wing Shing Wong. Prior to that, I received my BEng and Msc degree in 2012 and 2015, respectively, both from the University of Science and Technology of China. Students(博士生): 张浩然 研究方向：分布式在线凸优化 李紫微 研究方向：分布式机器学习, 在线学习 Students(硕士生): 徐洋 研究方向：分布式机器学习 陈浩旭 研究方向：Stochastic Bandit 吴光华"},{"title":"Main research interests","date":"2023-06-04T13:01:56.854Z","updated":"2023-06-04T12:39:10.000Z","comments":true,"path":"research/index.html","permalink":"http://distributed-learning.github.io/research/index.html","excerpt":"","text":"research directionLearning Theory Online Learning: Experts, Bandits, Online Convex Optimization, Multi-scale Online Learing，Online Learning with Attacks&#x2F;Corruptions Distributed Learning&#x2F;Estimation Online Optimization Online Knapsack Problems: Online Multidimensional Knapsack, Online Multiple Knapsack, Online Knapsack with Departure etc. Online Linear Programming, Online Buffer Management Networking Software Defined Networking, Cloud Computing, Data Centers, etc. Performance Analysis, Modeling, and Online Resource Optimization for Networked Computing Systems"},{"title":"alumni","date":"2023-06-04T04:08:14.000Z","updated":"2023-06-04T04:53:32.000Z","comments":true,"path":"alumni/index.html","permalink":"http://distributed-learning.github.io/alumni/index.html","excerpt":"","text":""}],"posts":[{"title":"Advanced Machine Learning Lab","slug":"Advanced Machine Learning Lab","date":"2023-06-04T12:45:52.000Z","updated":"2023-06-04T12:45:52.000Z","comments":true,"path":"2023/06/04/Advanced Machine Learning Lab/","link":"","permalink":"http://distributed-learning.github.io/2023/06/04/Advanced%20Machine%20Learning%20Lab/","excerpt":"","text":"Enrollment Guide：I do have several openings for students to work with me for a master&#x2F;PhD degree. Please drop me emails if you are interested in working in my group with the following topics: Online Learning Online Optimization Distributed Learning 实验室招收2024年推免硕士生、直博生，以及申请-考核制博士，研究方向为前沿机器学习理论相关课题（包括在线机器学习、可信机器学习、在线优化、分布式学习等）。有意向的同学请直接将简历发送邮箱：&#108;&#x69;&#110;&#x79;&#x61;&#110;&#x67;&#x40;&#110;&#106;&#x75;&#46;&#x65;&#100;&#117;&#x2e;&#x63;&#x6e;。 Publications： [AISTATS 2023] On-Demand Communication for Asynchronous Multi-Agent Bandits (to appear)Yu-zhen Janice Chen, Lin Yang*, Xuchuang Wang, Xutong Liu, Mohammad Hajiesmaili, John C.S. Lui, Don TowsleyThe 26th International Conference on Artificial Intelligence and Statistics (AISTATS 2023), 2023. [ICLR 2023] Achieve Near-Optimal Individual Regret &amp; Low Communications in Multi-Agent Bandits (to appear)Xuchuang Wang, Lin Yang*, Yu-zhen Janice Chen, Xutong Liu, Mohammad Hajiesmaili, Don Towsley, John C.S. LuiThe Eleventh International Conference on Learning Representations (ICLR 2023), 2023. [SIGMETRICS 2023] The Online Knapsack Problem with DeparturesBo Sun#, Lin Yang#, Mohammad Hajiesmaili, Adam Wierman, Don TowsleyACM International Conference on Measurement and Modeling of Computer Systems (SIGMETRICS), June 2023. (Full Paper). [SIGMETRICS 2022] Hierarchical Learning Algorithms for Multi-scale Expert ProblemsLin Yang, Yu-zhen Chen, Mohammad Hajiesmaili, Mark Herbster, Don TowsleyACM International Conference on Measurement and Modeling of Computer Systems (SIGMETRICS), June 2022. (Full Paper)Journal Version: Proceedings of the ACM on Measurement and Analysis of Computing Systems (POMACS), 2022, 6(2): 1-29. [INFOCOM 2022] Distributed Bandits with Heterogeneous AgentsLin Yang, Yu-zhen Chen, Mohammad Hajiesmaili, John CS Lui, Don TowsleyIEEE International Conference on Computer Communications (INFOCOM), 2022. [SIGMETRICS 2022] Competitive Algorithms for Online Multidimensional Knapsack ProblemsLin Yang, Ali Zeynali, Mohammad Hajiesmaili, Ramesh Sitaraman, Donald F. TowsleyACM International Conference on Measurement and Modeling of Computer Systems (SIGMETRICS), June 2022. (Full Paper)Journal Version: Proceedings of the ACM on Measurement and Analysis of Computing Systems (POMACS), 2021, 5(3): 1-30. [NeurIPS 2021] Cooperative Stochastic Bandits with Asynchronous Agents and Constrained FeedbackLin Yang, Yu-Zhen Janice Chen, Stephen Pasteris, Mohammad Hajiesmaili, John CS Lui, Don TowsleyAdvances in Neural Information Processing Systems (NeurIPS), 2021. [Performance 2021] Competitive Bidding Strategies for Online Linear Optimization with Inventory Management ConstraintsRussell Lee, Yutao Zhou, Lin Yang, Mohammad Hajiesmaili, Ramesh SitaramanIFIP Performance, 2021. Learning Based Control Policy and Regret Analysis for Online Quadratic Optimization with Asymmetric Information StructureCheng Tan, Lin Yang*, Wing Shing WongTransactions on Cybernetics, 2021. [NeurIPS 2020] Adversarial Bandits with Corruptions: Regret Lower Bound and No-regret AlgorithmLin Yang, Mohammad Hajiesmaili, Mohammad Sadegh Talebi, John CS Lui, Wing Shing WongAdvances in Neural Information Processing Systems (NeurIPS), 2020. [SIGMETRICS 2020] Online Linear Optimization with Inventory Management ConstraintsLin Yang#, Mohammad Hajiesmaili#, Ramesh Sitaraman, Adam Wierman, Enrique Mallada, Wing Shing WongACM International Conference on Measurement and Modeling of Computer Systems (SIGMETRICS), June 2020. (Full Paper)Journal Version: Proceedings of the ACM on Measurement and Analysis of Computing Systems (POMACS), 2020, 4(1): 1-29. Online Linear Programming with Uncertain ConstraintsLin Yang, Mohammad H. Hajiesmaili, and Wing Shing WongProceedings of The 53rd Annual Conference on Information Sciences and Systems (CISS). 2019. (Invited Paper) Stabilization of Discrete Time Stochastic System with Input Delay and Control Dependent Noise Cheng Tan, Lin Yang, Fangfang Zhang, Zhenqiang Zhang and Wing Shing WongSystems &amp; Control Letters, 2019, 123: 62–68. [SIGMETRICS 2018] [*An Optimal Algorithm for Online Non-Convex Learning*](https://yanglin2021.github.io/An Optimal Algorithm for Online Non-Convex Learning.pdf)Lin Yang, Lei Deng, Mohammad H. Hajiesmaili, Cheng Tan and Wing Shing WongACM International Conference on Measurement and Modeling of Computer Systems (SIGMETRICS), June 2018. (Full Paper)Journal Version: Proceedings of the ACM on Measurement and Analysis of Computing Systems (POMACS), 2018, 2(2): 25. An Average Queue-Length-Difference-Based Congestion Detection Algorithm in TCP&#x2F;AQM NetworkJin Zhu, Tong Luo, Lin Yang, Wanqing Xie, and G. E. DullerudInternational Journal of Adaptive Control and Signal Processing. 2018. [SIGMETRICS 2018] [*An Optimal Randomized Online Algorithm for QoS Buffer Management*](https://yanglin2021.github.io/An Optimal Randomized Online Algorithm for QoS Buffer Management.pdf)Lin Yang, Wing Shing Wong, and Mohammad H. HajiesmailiACM International Conference on Measurement and Modeling of Computer Systems (SIGMETRICS), June 2018. (Full Paper)Journal Version: Proceedings of the ACM on Measurement and Analysis of Computing Systems (POMACS), 2017, 1(2): 36. [SIGMETRICS 2017] Hour-Ahead Offering Strategies in Electricity Market for Power Producers with Storage and Intermittent SupplyLin Yang#, Mohammad H. Hajiesmaili#, Hanling Yi, and Minghua ChenACM International Conference on Measurement and Modeling of Computer Systems (SIGMETRICS), June 2017. (Poster Paper) Gittins Index Based Control Policy for a Class of Pursuit-Evasion ProblemsCheng Tan, Changbao Xu, Lin Yang, and Wing Shing WongIET Control Theory and Applications, 12(1), 110-118, 2017. Competitive Online Algorithms for Geographical Load Balancing in Data Centers with Energy StorageChi-Kin Chau, Lin YangProceedings of the 5th International Workshop on Energy Efficient Data Centres. 2016. An Optimal Vertical Handoff Decision Algorithm for Multiple Services with Different Priorities in Heterogeneous Wireless NetworksJin Zhu, Limin Xu, Lin Yang, Wanqing XieWireless Personal Communications 83 (1), 527-549, 2015. [ComLett] Time Series Analysis for Congestion Detection in TCP&#x2F;AQM NetworksLin Yang, Jin Zhu, Wanqing Xie, and G. E. DullerudIEEE Communications Letters, 19(3), 331-334, 2015. ​ (#: Equal Contribution or Co-first Author; *: Corresponding Author) ThesisLin Yang, “Competitive and Regret Analysis for Online Optimization.“","categories":[],"tags":[]}],"categories":[],"tags":[]}